---
title: "mutate"
format: 
  html:
    code-fold: false
    badges: true
author: '조윤호'
date: '8/20/2022'
title-block-banner: true
jupyter: R
categories: [R]
---

# mutate

mutate(filter, count, select, left_join, match), join

In [22]:
library('tidyverse')
library('nycflights13')

## mutate

### count, filter

- 테이블에서 기본키를 확인한 후 실제로 기본키가 각 관측값을 고유하게 식별하는지 확인하기 위해 `count`하고 `n`이 1보다 큰 항목을 찾는다.

In [3]:
weather %>%
count(year, month, day, hour, origin) %>%
filter(n > 1)

  year month day hour origin n
1 2013 11    3   1    EWR    2
2 2013 11    3   1    JFK    2
3 2013 11    3   1    LGA    2

In [4]:
flights %>%
count(year, month, day, flight) %>%
filter(n > 1) %>% head

  year month day flight n
1 2013 1     1    1     2
2 2013 1     1    3     2
3 2013 1     1    4     2
4 2013 1     1   11     3
5 2013 1     1   15     2
6 2013 1     1   21     2

### select

In [5]:
flights2 <- flights %>%
select(year:day, hour, origin, dest, tailnum, carrier)
flights2 %>% head

  year month day hour origin dest tailnum carrier
1 2013 1     1   5    EWR    IAH  N14228  UA
2 2013 1     1   5    LGA    IAH  N24211  UA
3 2013 1     1   5    JFK    MIA  N619AA  AA
4 2013 1     1   5    JFK    BQN  N804JB  B6
5 2013 1     1   6    LGA    ATL  N668DN  DL
6 2013 1     1   5    EWR    ORD  N39463  UA

### left_join

In [6]:
flights2 %>%
select(-origin, -dest) %>%
left_join(airlines, by = "carrier") %>% head

  year month day hour tailnum carrier name
1 2013 1     1   5    N14228  UA      United Air Lines Inc.
2 2013 1     1   5    N24211  UA      United Air Lines Inc.
3 2013 1     1   5    N619AA  AA      American Airlines Inc.
4 2013 1     1   5    N804JB  B6      JetBlue Airways
5 2013 1     1   6    N668DN  DL      Delta Air Lines Inc.
6 2013 1     1   5    N39463  UA      United Air Lines Inc.

In [7]:
flights2 %>%
select(-origin, -dest) %>% head

  year month day hour tailnum carrier
1 2013 1     1   5    N14228  UA
2 2013 1     1   5    N24211  UA
3 2013 1     1   5    N619AA  AA
4 2013 1     1   5    N804JB  B6
5 2013 1     1   6    N668DN  DL
6 2013 1     1   5    N39463  UA

In [8]:
airlines %>% head

  carrier name
1 9E      Endeavor Air Inc.
2 AA      American Airlines Inc.
3 AS      Alaska Airlines Inc.
4 B6      JetBlue Airways
5 DL      Delta Air Lines Inc.
6 EV      ExpressJet Airlines Inc.

`match` : 말 그대로 다른 데이터의 열의 항목과 이 열의 해당 항목에 맞는 것을 매치해준다.

### match

In [9]:
flights2 %>%
select(-origin, -dest) %>%
mutate(name = airlines$name[match(carrier, airlines$carrier)]) %>% head

  year month day hour tailnum carrier name
1 2013 1     1   5    N14228  UA      United Air Lines Inc.
2 2013 1     1   5    N24211  UA      United Air Lines Inc.
3 2013 1     1   5    N619AA  AA      American Airlines Inc.
4 2013 1     1   5    N804JB  B6      JetBlue Airways
5 2013 1     1   6    N668DN  DL      Delta Air Lines Inc.
6 2013 1     1   5    N39463  UA      United Air Lines Inc.

## join

`-` 예시 추가

In [10]:
x <- tribble(
    ~key, ~val_x,
    1, "x1",
    2, "x2",
    3, "x3"
    )
y <- tribble(
    ~key, ~val_y,
    1, "y1",
    2, "y2",
    4, "y3"
    )

In [11]:
x
y

  key val_x
1 1   x1
2 2   x2
3 3   x3

  key val_y
1 1   y1
2 2   y2
3 4   y3

In [12]:
x %>% inner_join(y, by = "key")

  key val_x val_y
1 1   x1    y1
2 2   x2    y2

> 조인 종류

### 이미지 삽입 예정

### 중복키

- 키가 고유하지 않고 중복일 경우?

In [13]:
x <- tribble(
    ~key, ~val_x,
    1, "x1",
    2, "x2",
    2, "x3",
    1, "x4"
    )
y <- tribble(
    ~key, ~val_y,
    1, "y1",
    2, "y2"
    )
left_join(x, y, by = "key")

  key val_x val_y
1 1   x1    y1
2 2   x2    y2
3 2   x3    y2
4 1   x4    y1

- 일반적으로 테이블 쌍에서 조인하려는 변수는 두 테이블에서 항상 하나의 변수(같은 이름)에 의해 조인되었다.<br>
`by = "key"`에 의해<br>
하지만, `by = NULL`를 사용하면 두 테이블에 있는 모든 변수를 사용하여 조인한다.<br>
이를 nature join이라 부름.

In [14]:
flights2 %>%
left_join(weather) %>% head

Joining, by = c("year", "month", "day", "hour", "origin")

  year month day hour origin dest tailnum carrier temp  dewp  humid wind_dir
1 2013 1     1   5    EWR    IAH  N14228  UA      39.02 28.04 64.43 260
2 2013 1     1   5    LGA    IAH  N24211  UA      39.92 24.98 54.81 250
3 2013 1     1   5    JFK    MIA  N619AA  AA      39.02 26.96 61.63 260
4 2013 1     1   5    JFK    BQN  N804JB  B6      39.02 26.96 61.63 260
5 2013 1     1   6    LGA    ATL  N668DN  DL      39.92 24.98 54.81 260
6 2013 1     1   5    EWR    ORD  N39463  UA      39.02 28.04 64.43 260
  wind_speed wind_gust precip pressure visib time_hour
1 12.65858         NA  0      1011.9   10    2013-01-01 05:00:00
2 14.96014   21.86482  0      1011.4   10    2013-01-01 05:00:00
3 14.96014         NA  0      1012.1   10    2013-01-01 05:00:00
4 14.96014         NA  0      1012.1   10    2013-01-01 05:00:00
5 16.11092   23.01560  0      1011.7   10    2013-01-01 06:00:00
6 12.65858         NA  0      1011.9   10    2013-01-01 05:00:00

`union` : 합집합 함수

In [15]:
union(colnames(flights2),colnames(weather))

 [1] "year"       "month"      "day"        "hour"       "origin"
 [6] "dest"       "tailnum"    "carrier"    "temp"       "dewp"
[11] "humid"      "wind_dir"   "wind_speed" "wind_gust"  "precip"
[16] "pressure"   "visib"      "time_hour"

- 결론 : 공통된 모든 변수로 조인

`-` 원래 하던 것처럼 특정 변수로 조인

In [16]:
flights2 %>%
left_join(planes, by = "tailnum") %>% head

  year.x month day hour origin dest tailnum carrier year.y
1 2013   1     1   5    EWR    IAH  N14228  UA      1999
2 2013   1     1   5    LGA    IAH  N24211  UA      1998
3 2013   1     1   5    JFK    MIA  N619AA  AA      1990
4 2013   1     1   5    JFK    BQN  N804JB  B6      2012
5 2013   1     1   6    LGA    ATL  N668DN  DL      1991
6 2013   1     1   5    EWR    ORD  N39463  UA      2012
  type                    manufacturer model     engines seats speed engine
1 Fixed wing multi engine BOEING       737-824   2       149   NA    Turbo-fan
2 Fixed wing multi engine BOEING       737-824   2       149   NA    Turbo-fan
3 Fixed wing multi engine BOEING       757-223   2       178   NA    Turbo-fan
4 Fixed wing multi engine AIRBUS       A320-232  2       200   NA    Turbo-fan
5 Fixed wing multi engine BOEING       757-232   2       178   NA    Turbo-fan
6 Fixed wing multi engine BOEING       737-924ER 2       191   NA    Turbo-fan

- 아래는 각 테이블에서 다른 이름의 변수이지만 하나로 통합해서 조인하고자 하는 경우<br>
조인후에는 첫 번째 변수의 이름으로 출력된다.<br>
여기서는 dest로 통합

In [17]:
flights2 %>%
left_join(airports, c("dest" = "faa")) %>% head

  year month day hour origin dest tailnum carrier
1 2013 1     1   5    EWR    IAH  N14228  UA
2 2013 1     1   5    LGA    IAH  N24211  UA
3 2013 1     1   5    JFK    MIA  N619AA  AA
4 2013 1     1   5    JFK    BQN  N804JB  B6
5 2013 1     1   6    LGA    ATL  N668DN  DL
6 2013 1     1   5    EWR    ORD  N39463  UA
  name                            lat      lon       alt  tz dst
1 George Bush Intercontinental    29.98443 -95.34144   97 -6 A
2 George Bush Intercontinental    29.98443 -95.34144   97 -6 A
3 Miami Intl                      25.79325 -80.29056    8 -5 A
4 NA                                    NA        NA   NA NA NA
5 Hartsfield Jackson Atlanta Intl 33.63672 -84.42807 1026 -5 A
6 Chicago Ohare Intl              41.97860 -87.90484  668 -6 A
  tzone
1 America/Chicago
2 America/Chicago
3 America/New_York
4 NA
5 America/New_York
6 America/Chicago

### filter join

In [18]:
top_dest <- flights %>%
count(dest, sort = TRUE) %>%
head(10)
top_dest

   dest n
1  ORD  17283
2  ATL  17215
3  LAX  16174
4  BOS  15508
5  MCO  14082
6  CLT  14064
7  SFO  13331
8  FLL  12055
9  MIA  11728
10 DCA   9705

In [19]:
flights %>%
filter(dest %in% top_dest$dest) %>% head

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   542      540             2        923      850
2 2013 1     1   554      600            -6        812      837
3 2013 1     1   554      558            -4        740      728
4 2013 1     1   555      600            -5        913      854
5 2013 1     1   557      600            -3        838      846
6 2013 1     1   558      600            -2        753      745
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
2 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
3  12       UA      1696   N39463  EWR    ORD  150       719     5    58
4  19       B6       507   N516JB  EWR    FLL  158      1065     6     0
5  -8       B6        79   N593JB  JFK    MCO  140       944     6     0
6   8       AA       301   N3ALAA  LGA    ORD  138       733     6     0
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 06:00:00
3 2013-01-01 05:00:00
4 2013-01-01 06:00:00
5 2013-01-01 06:00:00
6 2013-01-01 06:00:00

위에서 뽑은 상위 10개의 dest에 해당하는 열만 filtering

`semi_join` : 매칭에만 관심, 조건에 해당하는 항목을 매칭해준다.<br>
`anti_join` : y와 매치되는 x의 모든 관측값을 삭제한다.<br>
즉, 불일치 행만 모아준다.<br> 여기서는 매치되지 않는 항공편이 많은지 궁금할 때 사용

In [20]:
flights %>%
semi_join(top_dest) %>% head

Joining, by = "dest"

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   542      540             2        923      850
2 2013 1     1   554      600            -6        812      837
3 2013 1     1   554      558            -4        740      728
4 2013 1     1   555      600            -5        913      854
5 2013 1     1   557      600            -3        838      846
6 2013 1     1   558      600            -2        753      745
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
2 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
3  12       UA      1696   N39463  EWR    ORD  150       719     5    58
4  19       B6       507   N516JB  EWR    FLL  158      1065     6     0
5  -8       B6        79   N593JB  JFK    MCO  140       944     6     0
6   8       AA       301   N3ALAA  LGA    ORD  138       733     6     0
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 06:00:00
3 2013-01-01 05:00:00
4 2013-01-01 06:00:00
5 2013-01-01 06:00:00
6 2013-01-01 06:00:00

결과적으로 위의 `filter`와 같은 결과 나옴

In [21]:
flights %>%
anti_join(planes, by = "tailnum") %>%
count(tailnum, sort = TRUE) %>% head

  tailnum n
1 NA      2512
2 N725MQ   575
3 N722MQ   513
4 N723MQ   507
5 N713MQ   483
6 N735MQ   396

### 집합 연산

> `intersect(x,y)` : 교집합  
`union(x,y)` : 합집합  
`set_diff(x,y)` : x에는 있지만, y에는 없는 관측값 반환